# Lab-Data-Manipulation - Filtering Data

In [1]:
import pandas as pd

# Context 

For this lab you'll use a dataset for UFO observations. The objective is to exercise the manipulation of a dataframe, so we'll use the tools we've learned about `reading`, `renaming`, `selecting specific columns`, `filtering based on conditions` and `merging` dataframes to try to better understand our dataset and store an enriched version of our dataset at the end.

variable	|class|	description
------------|-----|-------------
date_time	|datetime (mdy h:m)	| Date time sighting occurred
city_area	|character	        | City or area of sighting
state	    |character          |	state/region of sighting
country	    |character          |	Country of sighting
ufo_shape	|character          |	UFO Shape
encounter_length	|double     |	Encounter length in seconds
described_encounter_length	|character |	Encounter length as described (eg 1 hour, etc)
description	|character          |	Description of encounter
date_documented	|character      |	Date documented
latitude	|double             |	Latitude
longitude	|double             |	Longitude

## Read the dataset and store it in a dataframe called `ufo`

Pay attention at the file separator.

In [4]:
ufo = pd.read_csv('data/ufo.csv', sep = ';')
ufo

,Unnamed: 0,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,date_documented,latitude,longitude
0,0,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.883056,-97.941111
1,1,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.384210,-98.581082
2,2,1955-10-10,1955,10,10,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.200000,-2.916667
3,3,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.978333,-96.645833
4,4,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.418056,-157.803611
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
80327,80327,2013-09-09,2013,9,9,9/9/2013 21:15,nashville,tn,us,light,600.0,10 minutes,Round from the distance/slowly changing colors...,9/30/2013,36.165833,-86.784444
80328,80328,2013-09-09,2013,9,9,9/9/2013 22:00,boise,id,us,circle,1200.0,20 minutes,Boise&#44 ID&#44 spherical&#44 20 min&#44 10 r...,9/30/2013,43.613611,-116.202500
80329,80329,2013-09-09,2013,9,9,9/9/2013 22:00,napa,ca,us,other,1200.0,hour,Napa UFO&#44,9/30/2013,38.297222,-122.284444
80330,80330,2013-09-09,2013,9,9,9/9/2013 22:20,vienna,va,us,circle,5.0,5 seconds,Saw a five gold lit cicular craft moving fastl...,9/30/2013,38.901111,-77.265556
80331,80331,2013-09-09,2013,9,9,9/9/2013 23:00,edmond,ok,us,cigar,1020.0,17 minutes,2 witnesses 2 miles apart&#44 Red &amp; White...,9/30/2013,35.652778,-97.477778

## Check the first 6 rows of the dataframe

In [5]:
ufo.head(6)

,Unnamed: 0,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,date_documented,latitude,longitude
0,0,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.883056,-97.941111
1,1,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.384210,-98.581082
2,2,1955-10-10,1955,10,10,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.200000,-2.916667
3,3,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.978333,-96.645833
4,4,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.418056,-157.803611
5,5,1961-10-10,1961,10,10,10/10/1961 19:00,bristol,tn,us,sphere,300.0,5 minutes,My father is now 89 my brother 52 the girl wit...,4/27/2007,36.595000,-82.188889

## Check the shape of your dataframe to see how many rows and columns it has

In [6]:
ufo.shape

(80332, 16)

## Bring the date information to the beginning of the dataframe

If you check the dataframe columns, there are some information of the date at the end of the dataframe. For this task, you should reorder the columns in a way that the first few columns all show the date information. 

*Hint: Use the ufo.columns to see all the column names you have.*

In [7]:
ufo.columns

Index(['Unnamed: 0', 'date', 'year', 'month', 'day', 'date_time', 'city_area',
       'state', 'country', 'ufo_shape', 'encounter_length',
       'described_encounter_length', 'description', 'date_documented',
       'latitude', 'longitude'],
      dtype='object')

In [8]:
desired_order = ['date_time', 'date', 'year', 'month', 'day', 'date_documented',
       'state', 'country', 'ufo_shape', 'encounter_length',
       'described_encounter_length', 'description','latitude', 'longitude', 'Unnamed: 0','city_area']
ufo = ufo[desired_order]
ufo

,date_time,date,year,month,day,date_documented,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude,Unnamed: 0,city_area
0,10/10/1949 20:30,1949-10-10,1949,10,10,4/27/2004,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,29.883056,-97.941111,0,san marcos
1,10/10/1949 21:00,1949-10-10,1949,10,10,12/16/2005,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082,1,lackland afb
2,10/10/1955 17:00,1955-10-10,1955,10,10,1/21/2008,NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667,2,chester (uk/england)
3,10/10/1956 21:00,1956-10-10,1956,10,10,1/17/2004,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,28.978333,-96.645833,3,edna
4,10/10/1960 20:00,1960-10-10,1960,10,10,1/22/2004,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611,4,kaneohe
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
80327,9/9/2013 21:15,2013-09-09,2013,9,9,9/30/2013,tn,us,light,600.0,10 minutes,Round from the distance/slowly changing colors...,36.165833,-86.784444,80327,nashville
80328,9/9/2013 22:00,2013-09-09,2013,9,9,9/30/2013,id,us,circle,1200.0,20 minutes,Boise&#44 ID&#44 spherical&#44 20 min&#44 10 r...,43.613611,-116.202500,80328,boise
80329,9/9/2013 22:00,2013-09-09,2013,9,9,9/30/2013,ca,us,other,1200.0,hour,Napa UFO&#44,38.297222,-122.284444,80329,napa
80330,9/9/2013 22:20,2013-09-09,2013,9,9,9/30/2013,va,us,circle,5.0,5 seconds,Saw a five gold lit cicular craft moving fastl...,38.901111,-77.265556,80330,vienna
80331,9/9/2013 23:00,2013-09-09,2013,9,9,9/30/2013,ok,us,cigar,1020.0,17 minutes,2 witnesses 2 miles apart&#44 Red &amp; White...,35.652778,-97.477778,80331,edmond

## Just check if you did it the right way. Take a look at the head of the dataframe again and see if the `ufo` dataframe now is reordered.

In [9]:
ufo.head(6)

,date_time,date,year,month,day,date_documented,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude,Unnamed: 0,city_area
0,10/10/1949 20:30,1949-10-10,1949,10,10,4/27/2004,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,29.883056,-97.941111,0,san marcos
1,10/10/1949 21:00,1949-10-10,1949,10,10,12/16/2005,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082,1,lackland afb
2,10/10/1955 17:00,1955-10-10,1955,10,10,1/21/2008,NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667,2,chester (uk/england)
3,10/10/1956 21:00,1956-10-10,1956,10,10,1/17/2004,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,28.978333,-96.645833,3,edna
4,10/10/1960 20:00,1960-10-10,1960,10,10,1/22/2004,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611,4,kaneohe
5,10/10/1961 19:00,1961-10-10,1961,10,10,4/27/2007,tn,us,sphere,300.0,5 minutes,My father is now 89 my brother 52 the girl wit...,36.595000,-82.188889,5,bristol

## Select a piece of your dataframe. We won't work with the whole dataframe for now, just a few columns. Create a new dataframe called `ufo_vars` and select only the following columns of the `ufo` dataframe. 

`year`, `month`, `state`, `country`, `ufo_shape`, `encounter_length`

In [11]:
ufo_vars = ufo[['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']]

Perform a *.head()* on your result to check if you did it right.

Expected output:


|    |   year |   month | state   | country   | ufo_shape   |   encounter_length |
|---:|-------:|--------:|:--------|:----------|:------------|-------------------:|
|  0 |   1949 |      10 | tx      | us        | cylinder    |               2700 |
|  1 |   1949 |      10 | tx      | nan       | light       |               7200 |
|  2 |   1955 |      10 | nan     | gb        | circle      |                 20 |
|  3 |   1956 |      10 | tx      | us        | circle      |                 20 |
|  4 |   1960 |      10 | hi      | us        | light       |                900 |

In [14]:
ufo_vars.head()

   year  month state country ufo_shape  encounter_length
0  1949     10    tx      us  cylinder            2700.0
1  1949     10    tx     NaN     light            7200.0
2  1955     10   NaN      gb    circle              20.0
3  1956     10    tx      us    circle              20.0
4  1960     10    hi      us     light             900.0

## Rename the variable `encounter_length` to `encounter_seconds`. Keep using the `ufo_vars` dataset for the following tasks, unless specifically specified.

Again, check your results to check if you did it right.

Expected output:


|    |   year |   month | state   | country   | ufo_shape   |   encounter_seconds |
|---:|-------:|--------:|:--------|:----------|:------------|--------------------:|
|  0 |   1949 |      10 | tx      | us        | cylinder    |                2700 |
|  1 |   1949 |      10 | tx      | nan       | light       |                7200 |
|  2 |   1955 |      10 | nan     | gb        | circle      |                  20 |
|  3 |   1956 |      10 | tx      | us        | circle      |                  20 |
|  4 |   1960 |      10 | hi      | us        | light       |                 900 |

In [16]:
ufo_vars2 = ufo_vars.rename(columns = {'encounter_length': 'encounter_seconds'}) 
ufo_vars2.head()

   year  month state country ufo_shape  encounter_seconds
0  1949     10    tx      us  cylinder             2700.0
1  1949     10    tx     NaN     light             7200.0
2  1955     10   NaN      gb    circle               20.0
3  1956     10    tx      us    circle               20.0
4  1960     10    hi      us     light              900.0

## Let's start filtering some records. Create a new dataframe called `ufo_us` and filter the `ufo_vars` dataframe bringing only the results in which the `country` is `"us"`



Expected output:


|    |   year |   month | state   | country   | ufo_shape   |   encounter_seconds |
|---:|-------:|--------:|:--------|:----------|:------------|--------------------:|
|  0 |   1949 |      10 | tx      | us        | cylinder    |                2700 |
|  3 |   1956 |      10 | tx      | us        | circle      |                  20 |
|  4 |   1960 |      10 | hi      | us        | light       |                 900 |
|  5 |   1961 |      10 | tn      | us        | sphere      |                 300 |
|  7 |   1965 |      10 | ct      | us        | disk        |                1200 |

In [23]:
mask = ufo_vars2['country'] == 'us'

ufo_us = ufo_vars2[mask]
ufo_us.head()

   year  month state country ufo_shape  encounter_seconds
0  1949     10    tx      us  cylinder             2700.0
3  1956     10    tx      us    circle               20.0
4  1960     10    hi      us     light              900.0
5  1961     10    tn      us    sphere              300.0
7  1965     10    ct      us      disk             1200.0

### Use the `.query()` method to perform the same task as above

In [31]:
ufo_us = ufo_vars2.query("country == 'us'")
ufo_us.head()

   year  month state country ufo_shape  encounter_seconds
0  1949     10    tx      us  cylinder             2700.0
3  1956     10    tx      us    circle               20.0
4  1960     10    hi      us     light              900.0
5  1961     10    tn      us    sphere              300.0
7  1965     10    ct      us      disk             1200.0

See which one do you prefer the most and keep using it for the exercises that follow

## For the `ufo_us` dataframe, select only the cases in which the year is in the first decade (2001-2010). Put that in a variable called `ufo_us_2000`.

Check your results.

In [41]:
mask2 = (ufo_us["year"] >= 2001) & (ufo_us["year"] <=2010)
ufo_us_2000 = ufo_us[mask2]
#ufo_us_2000.year.value_counts()
ufo_us_2000

       year  month state country  ufo_shape  encounter_seconds
102    2001     10    ia      us   triangle              240.0
105    2001     10    ca      us     circle              120.0
106    2001     10    ia      us  rectangle              300.0
107    2001     10    ca      us   changing              900.0
108    2001     10    az      us   triangle               60.0
...     ...    ...   ...     ...        ...                ...
80269  2010      9    mi      us   changing              300.0
80270  2010      9    fl      us       oval             2700.0
80271  2010      9    fl      us       oval             7200.0
80272  2010      9    nm      us   fireball              300.0
80273  2010      9    ca      us     circle              300.0

[31910 rows x 6 columns]

## Try to do the same without the intermediate step of creating the `ufo_us` dataframe. That is, try to filter the dataset for the cases in which the country is "us" and the year is (2001-2010) from the original dataframe.



*Hint:* You have to make sure all of these conditions are applied simultaneously - using the `and` (or `&`) operator. Try to understand when to use the `and` and the `&` operator.

In [40]:
ufo_us_2k = ufo[(ufo["country"] == "us")&(ufo["year"] >= 2001)&(ufo["year"] <=2010)] 
ufo_us_2k

,date_time,date,year,month,day,date_documented,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude,Unnamed: 0,city_area
102,10/10/2001 03:00,2001-10-10,2001,10,10,7/1/2002,ia,us,triangle,240.0,4 min.s,Large&#44silent&#44slow&#44low to the ground d...,42.395278,-94.633611,102,rockwell city
105,10/10/2001 20:35,2001-10-10,2001,10,10,11/20/2001,ca,us,circle,120.0,2/min.,FALLING STAR STOPS &#39SHOTS OUT DOZENS OF ...,37.668889,-122.079722,105,hayward
106,10/10/2001 21:15,2001-10-10,2001,10,10,11/20/2001,ia,us,rectangle,300.0,3-5 minutes,We saw a square object at night&#44 which had...,41.004167,-92.373611,106,ottumwa
107,10/10/2001 21:30,2001-10-10,2001,10,10,11/20/2001,ca,us,changing,900.0,15 min. apprx,Objects were sighted driving north on Highway ...,36.747778,-119.771389,107,fresno
108,10/10/2001 22:00,2001-10-10,2001,10,10,11/20/2001,az,us,triangle,60.0,less then a minute,Triangle shaped craft spotted flying west to e...,33.448333,-112.073333,108,phoenix
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
80269,9/9/2010 21:30,2010-09-09,2010,9,9,11/21/2010,mi,us,changing,300.0,3-5 minutes,Glittery random lights near each other&#44 rea...,42.529444,-83.780278,80269,brighton
80270,9/9/2010 22:00,2010-09-09,2010,9,9,11/21/2010,fl,us,oval,2700.0,45 min,2nd night watching the objects&#44 approximate...,29.651389,-82.325000,80270,gainesville
80271,9/9/2010 22:00,2010-09-09,2010,9,9,11/21/2010,fl,us,oval,7200.0,2+ hrs,Multiple sightings by multiple whitnesses&#44 ...,29.651389,-82.325000,80271,gainesville
80272,9/9/2010 22:00,2010-09-09,2010,9,9,11/21/2010,nm,us,fireball,300.0,3 to 5 mins,orange lights in the southeastern sky in New M...,34.159722,-106.909722,80272,lemitar
80273,9/9/2010 23:19,2010-09-09,2010,9,9,11/21/2010,ca,us,circle,300.0,3-5 min,It appeared to be an orange round object movin...,34.097500,-117.647500,80273,upland

## BONUS 1:  Take a look at the column named `ufo_shape`. Compare the number of triangular UFO occurrances in the US from the year 2001 up to 2010 as compared to the years of 1991 up to 2000.

*Hint: you should expect roughly ~3 times more cases for 2001-2010 than 1991-2000.*

In [45]:
# calculate the dataframe from 2001-2010 here

ufo_us_2k = ufo_us_2k[ufo_us_2k['ufo_shape'] == 'triangle'] 
len(ufo_us_2k)

3353

In [46]:
# calculate the dataframe from 1991-2000 here
ufo_us_1991 = ufo[(ufo["country"] == "us")&(ufo["year"] >= 1991)&(ufo["year"] <=2000)&(ufo['ufo_shape'] == "triangle" )] 
len(ufo_us_1991)

1116

## BONUS 1.1: Count how many values does each category of `ufo_shape` has. 

Expected output:

````
        light        16565
        triangle      7865
        circle        7608
        fireball      6208
        other         5649
        unknown       5584
        sphere        5387
        disk          5213
        oval          3733
        formation     2457
        cigar         2057
        changing      1962
        flash         1328
        rectangle     1297
        cylinder      1283
        diamond       1178
        chevron        952
        egg            759
        teardrop       750
        cone           316
        cross          233
        delta            7
        round            2
        crescent         2
        dome             1
        pyramid          1
        changed          1
        hexagon          1
        flare            1
        Name: ufo_shape, dtype: int64

````

In [47]:
ufo.ufo_shape.value_counts()

light        16565
triangle      7865
circle        7608
fireball      6208
other         5649
unknown       5584
sphere        5387
disk          5213
oval          3733
formation     2457
cigar         2057
changing      1962
flash         1328
rectangle     1297
cylinder      1283
diamond       1178
chevron        952
egg            759
teardrop       750
cone           316
cross          233
delta            7
round            2
crescent         2
pyramid          1
flare            1
hexagon          1
dome             1
changed          1
Name: ufo_shape, dtype: int64

### Mask hints 

A `mask` is nothing more than a condition. This condition is applied to your whole dataframe (or pandas Series).
So for example, if you had a pandas Series with a variable called `Age`, you could create a mask for all people whose `Age` is less than 18 years old using the syntax:

`df['Age'] <= 18`

This would return a pandas series containing `True` and `False` values. For each index, you'd get a value of `True` or `False`.

You could save this mask in a variable, for example:

`condition = (df['Age'] <= 18)`

And then you could use that variable `condition` to select only the cases of the dataframe in which the index returned `True` using:
`df.loc[condition, :]`.


### `.query()` hints

Remember that the .query() method expects a string. That string should contain the variable of your dataframe without quotation marks and the comparison. For example, if you had a variable called `name`, you'd use a syntax like:
 `df.query('name == "Jack"')`
 
to bring all observations whose column `name` is exactly equal to `"Jack"` (note that Jack should be within quotation marks because a name is a string in this example).